let answer = [
    "イギリス","フランス","イタリア","イタリア","フランス",
    "フランス","スペイン","イギリス","フランス","イタリア",
    "イタリア","スペイン","フランス","フランス","スペイン",
    "イタリア","フランス","イタリア","ドイツ","スペイン",
    "イタリア","イタリア","フランス","ドイツ","イタリア",
    "イギリス","フランス","イギリス","イタリア","スペイン",
    "スペイン","イタリア","イギリス","スペイン","イタリア",
    "ドイツ","イギリス","イタリア","スペイン","イタリア"
];

let counter = new Map();

for (let a of answer) {
    if (counter.has(a)) {
        counter.set(a, counter.get(a) + 1);
    } else {
        counter.set(a, 1);
    }
}

for (let[country, cnt] of counter) {
    console.log(`${country}: ${cnt}`);
}