let patients = [
    "福岡市中央区,30,男",
    "福岡市中央区,40,女",
    "福岡市中央区,50,男",
    "福岡市博多区,40,女",
    "福岡市博多区,30,女",
    "福岡市博多区,40,男",
    "福岡市博多区,60,男",
    "福岡市博多区,40,男",
    "福岡市中央区,30,女",
    "福岡市中央区,50,男",
    "福岡市博多区,70,女",
    "福岡市博多区,80,男",
    "福岡市中央区,60,男",
    "福岡市中央区,70,女",
    "福岡市中央区,20,男",
    "福岡市中央区,50,男",
    "福岡市中央区,70,男",
    "福岡市中央区,30,男",
    "福岡市中央区,20,男",
    "福岡市中央区,20,男",
    "福岡市中央区,40,男",
    "福岡市中央区,30,女",
    "福岡市中央区,10,男",
    "福岡市博多区,40,男",
    "福岡市博多区,20,男",
    "福岡市博多区,50,男",
    "福岡市博多区,50,女",
    "福岡市中央区,70,女",
    "福岡市中央区,20,女",
    "福岡市博多区,20,女",
    "福岡市博多区,20,男",
    "福岡市博多区,60,男",
    "福岡市中央区,60,男",
    "福岡市中央区,60,女",
    "福岡市中央区,60,男",
    "福岡市博多区,30,男",
    "福岡市博多区,40,男",
    "福岡市博多区,30,男",
    "福岡市博多区,50,女",
    "福岡市中央区,50,女",
    "福岡市博多区,70,男",
    "福岡市博多区,80,男",
    "東京都世田谷区,23,男",
    "福岡市博多区,,男",
];
/*
let patients_assoc = {
    東区: { '0': 3, '10': 12, '20': 120, '30': 102, '40': 72, '50': 61, '60': 40, '70': 44, '80': 50 },
    博多区: { '0': 19, '10': 33, '20': 332, '30': 289, '40': 128, '50': 157, '60': 83, '70': 61, '80': 37 },
}
patients_assoc['博多区']['20']++;
console.log(patients_assoc['博多区']['20']);
*/

/*
 前処理
*/
let districts = ['東区', '博多区', '中央区', '南区', '城南区', '早良区', '西区'];
let ages = ['0', '10', '20', '30', '40', '50', '60', '70', '80'];

let patients_assoc = {};
for (let district of districts) {
    let district_age = {}; // {'0': 0, '10': 0, ... , '80': 0}
    for (let age of ages) {
        district_age[age] = 0; // 
    }
    patients_assoc[district] = district_age;
}

console.log(patients_assoc);

for (let patient of patients) {
    let [district, age, gender] = patient.split(/\s*,\s*/);
    if (districts.indexOf(district.substr(3)) === -1) continue;
    if (ages.indexOf(age) === -1) continue;
    patients_assoc[district.substr(3)][age]++;
}

console.log(patients_assoc);
